---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.LightingDevice
source: html/2acc2724-620b-6f71-848b-c991ca6439a0.htm
---
# LightingDevice Methods

Causes the object to release immediately any resources it may be utilizing.